; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-30)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 )
(:init
(arm-empty)
(on b1 b22)
(on-table b2)
(on-table b3)
(on b4 b28)
(on b5 b29)
(on b6 b21)
(on b7 b6)
(on b8 b14)
(on b9 b17)
(on b10 b3)
(on b11 b18)
(on b12 b5)
(on b13 b27)
(on-table b14)
(on b15 b20)
(on b16 b10)
(on b17 b2)
(on b18 b26)
(on-table b19)
(on b20 b24)
(on b21 b13)
(on b22 b8)
(on-table b23)
(on-table b24)
(on-table b25)
(on-table b26)
(on b27 b25)
(on b28 b1)
(on b29 b30)
(on-table b30)
(clear b4)
(clear b7)
(clear b9)
(clear b11)
(clear b12)
(clear b15)
(clear b16)
(clear b19)
(clear b23)
)
(:goal
(and
(on b1 b29)
(on-table b2)
(on b3 b21)
(on b4 b9)
(on b5 b23)
(on b6 b3)
(on b7 b11)
(on b8 b6)
(on-table b9)
(on b10 b7)
(on b11 b4)
(on b12 b24)
(on b13 b5)
(on b14 b20)
(on b15 b30)
(on b16 b13)
(on b17 b12)
(on b18 b19)
(on b19 b1)
(on b20 b26)
(on b21 b2)
(on b22 b17)
(on-table b23)
(on b24 b28)
(on b25 b10)
(on b26 b15)
(on-table b27)
(on b28 b25)
(on b29 b16)
(on b30 b18))
)
)

; plan
1. (unstack b9 b17)
   deleted: (on b9 b17) (clear b9) (arm-empty)
   added: (holding b9) (clear b17)
   goals met: 2 of 30
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 30
3. (unstack b7 b6)
   deleted: (on b7 b6) (clear b7) (arm-empty)
   added: (holding b7) (clear b6)
   goals met: 3 of 30
4. (stack b7 b11)
   deleted: (clear b11) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b11)
   goals met: 4 of 30
5. (unstack b4 b28)
   deleted: (on b4 b28) (clear b4) (arm-empty)
   added: (holding b4) (clear b28)
   goals met: 4 of 30
6. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 5 of 30
7. (unstack b17 b2)
   deleted: (on b17 b2) (clear b17) (arm-empty)
   added: (holding b17) (clear b2)
   goals met: 5 of 30
8. (stack b17 b12)
   deleted: (clear b12) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b12)
   goals met: 6 of 30
9. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 6 of 30
10. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 30
11. (unstack b21 b13)
   deleted: (on b21 b13) (clear b21) (arm-empty)
   added: (holding b21) (clear b13)
   goals met: 6 of 30
12. (stack b21 b2)
   deleted: (clear b2) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b2)
   goals met: 7 of 30
13. (unstack b16 b10)
   deleted: (on b16 b10) (clear b16) (arm-empty)
   added: (holding b16) (clear b10)
   goals met: 7 of 30
14. (stack b16 b13)
   deleted: (clear b13) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b13)
   goals met: 8 of 30
15. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 8 of 30
16. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 9 of 30
17. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 30
18. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 10 of 30
19. (unstack b28 b1)
   deleted: (on b28 b1) (clear b28) (arm-empty)
   added: (holding b28) (clear b1)
   goals met: 10 of 30
20. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 10 of 30
21. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 10 of 30
22. (stack b19 b1)
   deleted: (clear b1) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b1)
   goals met: 11 of 30
23. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 10 of 30
24. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 10 of 30
25. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 10 of 30
26. (stack b3 b21)
   deleted: (clear b21) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b21)
   goals met: 11 of 30
27. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 11 of 30
28. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 12 of 30
29. (unstack b16 b13)
   deleted: (on b16 b13) (clear b16) (arm-empty)
   added: (holding b16) (clear b13)
   goals met: 11 of 30
30. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 11 of 30
31. (unstack b13 b27)
   deleted: (on b13 b27) (clear b13) (arm-empty)
   added: (holding b13) (clear b27)
   goals met: 11 of 30
32. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 11 of 30
33. (unstack b27 b25)
   deleted: (on b27 b25) (clear b27) (arm-empty)
   added: (holding b27) (clear b25)
   goals met: 11 of 30
34. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 12 of 30
35. (pickup b28)
   deleted: (clear b28) (on-table b28) (arm-empty)
   added: (holding b28)
   goals met: 12 of 30
36. (stack b28 b25)
   deleted: (clear b25) (holding b28)
   added: (arm-empty) (clear b28) (on b28 b25)
   goals met: 13 of 30
37. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 13 of 30
38. (stack b16 b13)
   deleted: (clear b13) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b13)
   goals met: 14 of 30
39. (unstack b28 b25)
   deleted: (on b28 b25) (clear b28) (arm-empty)
   added: (holding b28) (clear b25)
   goals met: 13 of 30
40. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 13 of 30
41. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 13 of 30
42. (stack b25 b10)
   deleted: (clear b10) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b10)
   goals met: 14 of 30
43. (pickup b28)
   deleted: (clear b28) (on-table b28) (arm-empty)
   added: (holding b28)
   goals met: 14 of 30
44. (stack b28 b25)
   deleted: (clear b25) (holding b28)
   added: (arm-empty) (clear b28) (on b28 b25)
   goals met: 15 of 30
45. (unstack b15 b20)
   deleted: (on b15 b20) (clear b15) (arm-empty)
   added: (holding b15) (clear b20)
   goals met: 15 of 30
46. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 15 of 30
47. (unstack b20 b24)
   deleted: (on b20 b24) (clear b20) (arm-empty)
   added: (holding b20) (clear b24)
   goals met: 15 of 30
48. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 15 of 30
49. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 15 of 30
50. (stack b24 b28)
   deleted: (clear b28) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b28)
   goals met: 16 of 30
51. (unstack b17 b12)
   deleted: (on b17 b12) (clear b17) (arm-empty)
   added: (holding b17) (clear b12)
   goals met: 15 of 30
52. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 15 of 30
53. (unstack b12 b5)
   deleted: (on b12 b5) (clear b12) (arm-empty)
   added: (holding b12) (clear b5)
   goals met: 15 of 30
54. (stack b12 b24)
   deleted: (clear b24) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b24)
   goals met: 16 of 30
55. (unstack b5 b29)
   deleted: (on b5 b29) (clear b5) (arm-empty)
   added: (holding b5) (clear b29)
   goals met: 16 of 30
56. (stack b5 b23)
   deleted: (clear b23) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b23)
   goals met: 17 of 30
57. (unstack b29 b30)
   deleted: (on b29 b30) (clear b29) (arm-empty)
   added: (holding b29) (clear b30)
   goals met: 17 of 30
58. (stack b29 b16)
   deleted: (clear b16) (holding b29)
   added: (arm-empty) (clear b29) (on b29 b16)
   goals met: 18 of 30
59. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 18 of 30
60. (stack b17 b12)
   deleted: (clear b12) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b12)
   goals met: 19 of 30
61. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 19 of 30
62. (stack b15 b30)
   deleted: (clear b30) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b30)
   goals met: 20 of 30
63. (unstack b19 b1)
   deleted: (on b19 b1) (clear b19) (arm-empty)
   added: (holding b19) (clear b1)
   goals met: 19 of 30
64. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 19 of 30
65. (unstack b1 b22)
   deleted: (on b1 b22) (clear b1) (arm-empty)
   added: (holding b1) (clear b22)
   goals met: 19 of 30
66. (stack b1 b29)
   deleted: (clear b29) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b29)
   goals met: 20 of 30
67. (unstack b22 b8)
   deleted: (on b22 b8) (clear b22) (arm-empty)
   added: (holding b22) (clear b8)
   goals met: 20 of 30
68. (stack b22 b17)
   deleted: (clear b17) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b17)
   goals met: 21 of 30
69. (unstack b8 b14)
   deleted: (on b8 b14) (clear b8) (arm-empty)
   added: (holding b8) (clear b14)
   goals met: 21 of 30
70. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 22 of 30
71. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 22 of 30
72. (stack b19 b1)
   deleted: (clear b1) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b1)
   goals met: 23 of 30
73. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 23 of 30
74. (stack b14 b20)
   deleted: (clear b20) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b20)
   goals met: 24 of 30
75. (unstack b19 b1)
   deleted: (on b19 b1) (clear b19) (arm-empty)
   added: (holding b19) (clear b1)
   goals met: 23 of 30
76. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 23 of 30
77. (unstack b1 b29)
   deleted: (on b1 b29) (clear b1) (arm-empty)
   added: (holding b1) (clear b29)
   goals met: 22 of 30
78. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 22 of 30
79. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 22 of 30
80. (stack b19 b1)
   deleted: (clear b1) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b1)
   goals met: 23 of 30
81. (unstack b29 b16)
   deleted: (on b29 b16) (clear b29) (arm-empty)
   added: (holding b29) (clear b16)
   goals met: 22 of 30
82. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 22 of 30
83. (unstack b16 b13)
   deleted: (on b16 b13) (clear b16) (arm-empty)
   added: (holding b16) (clear b13)
   goals met: 21 of 30
84. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 21 of 30
85. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 21 of 30
86. (stack b13 b5)
   deleted: (clear b5) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b5)
   goals met: 22 of 30
87. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 22 of 30
88. (stack b16 b13)
   deleted: (clear b13) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b13)
   goals met: 23 of 30
89. (pickup b29)
   deleted: (clear b29) (on-table b29) (arm-empty)
   added: (holding b29)
   goals met: 23 of 30
90. (stack b29 b16)
   deleted: (clear b16) (holding b29)
   added: (arm-empty) (clear b29) (on b29 b16)
   goals met: 24 of 30
91. (unstack b19 b1)
   deleted: (on b19 b1) (clear b19) (arm-empty)
   added: (holding b19) (clear b1)
   goals met: 23 of 30
92. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 23 of 30
93. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 23 of 30
94. (stack b1 b29)
   deleted: (clear b29) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b29)
   goals met: 24 of 30
95. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 24 of 30
96. (stack b19 b1)
   deleted: (clear b1) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b1)
   goals met: 25 of 30
97. (unstack b22 b17)
   deleted: (on b22 b17) (clear b22) (arm-empty)
   added: (holding b22) (clear b17)
   goals met: 24 of 30
98. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 24 of 30
99. (unstack b17 b12)
   deleted: (on b17 b12) (clear b17) (arm-empty)
   added: (holding b17) (clear b12)
   goals met: 23 of 30
100. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 23 of 30
101. (unstack b12 b24)
   deleted: (on b12 b24) (clear b12) (arm-empty)
   added: (holding b12) (clear b24)
   goals met: 22 of 30
102. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 22 of 30
103. (unstack b24 b28)
   deleted: (on b24 b28) (clear b24) (arm-empty)
   added: (holding b24) (clear b28)
   goals met: 21 of 30
104. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 21 of 30
105. (unstack b28 b25)
   deleted: (on b28 b25) (clear b28) (arm-empty)
   added: (holding b28) (clear b25)
   goals met: 20 of 30
106. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 20 of 30
107. (unstack b25 b10)
   deleted: (on b25 b10) (clear b25) (arm-empty)
   added: (holding b25) (clear b10)
   goals met: 19 of 30
108. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 19 of 30
109. (pickup b28)
   deleted: (clear b28) (on-table b28) (arm-empty)
   added: (holding b28)
   goals met: 19 of 30
110. (stack b28 b25)
   deleted: (clear b25) (holding b28)
   added: (arm-empty) (clear b28) (on b28 b25)
   goals met: 20 of 30
111. (unstack b10 b7)
   deleted: (on b10 b7) (clear b10) (arm-empty)
   added: (holding b10) (clear b7)
   goals met: 19 of 30
112. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 19 of 30
113. (unstack b7 b11)
   deleted: (on b7 b11) (clear b7) (arm-empty)
   added: (holding b7) (clear b11)
   goals met: 18 of 30
114. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 18 of 30
115. (unstack b11 b18)
   deleted: (on b11 b18) (clear b11) (arm-empty)
   added: (holding b11) (clear b18)
   goals met: 18 of 30
116. (stack b11 b4)
   deleted: (clear b4) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b4)
   goals met: 19 of 30
117. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 19 of 30
118. (stack b7 b11)
   deleted: (clear b11) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b11)
   goals met: 20 of 30
119. (unstack b18 b26)
   deleted: (on b18 b26) (clear b18) (arm-empty)
   added: (holding b18) (clear b26)
   goals met: 20 of 30
120. (stack b18 b19)
   deleted: (clear b19) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b19)
   goals met: 21 of 30
121. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 21 of 30
122. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 22 of 30
123. (pickup b26)
   deleted: (clear b26) (on-table b26) (arm-empty)
   added: (holding b26)
   goals met: 22 of 30
124. (stack b26 b15)
   deleted: (clear b15) (holding b26)
   added: (arm-empty) (clear b26) (on b26 b15)
   goals met: 23 of 30
125. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 23 of 30
126. (stack b24 b28)
   deleted: (clear b28) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b28)
   goals met: 24 of 30
127. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 24 of 30
128. (stack b22 b17)
   deleted: (clear b17) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b17)
   goals met: 25 of 30
129. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 25 of 30
130. (stack b12 b24)
   deleted: (clear b24) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b24)
   goals met: 26 of 30
131. (unstack b14 b20)
   deleted: (on b14 b20) (clear b14) (arm-empty)
   added: (holding b14) (clear b20)
   goals met: 25 of 30
132. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 25 of 30
133. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 25 of 30
134. (stack b20 b26)
   deleted: (clear b26) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b26)
   goals met: 26 of 30
135. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 26 of 30
136. (stack b14 b20)
   deleted: (clear b20) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b20)
   goals met: 27 of 30
137. (unstack b22 b17)
   deleted: (on b22 b17) (clear b22) (arm-empty)
   added: (holding b22) (clear b17)
   goals met: 26 of 30
138. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 26 of 30
139. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 26 of 30
140. (stack b17 b12)
   deleted: (clear b12) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b12)
   goals met: 27 of 30
141. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 27 of 30
142. (stack b22 b17)
   deleted: (clear b17) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b17)
   goals met: 28 of 30
143. (unstack b14 b20)
   deleted: (on b14 b20) (clear b14) (arm-empty)
   added: (holding b14) (clear b20)
   goals met: 27 of 30
144. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 27 of 30
145. (unstack b20 b26)
   deleted: (on b20 b26) (clear b20) (arm-empty)
   added: (holding b20) (clear b26)
   goals met: 26 of 30
146. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 26 of 30
147. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 26 of 30
148. (stack b14 b20)
   deleted: (clear b20) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b20)
   goals met: 27 of 30
149. (unstack b26 b15)
   deleted: (on b26 b15) (clear b26) (arm-empty)
   added: (holding b26) (clear b15)
   goals met: 26 of 30
150. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 26 of 30
151. (unstack b15 b30)
   deleted: (on b15 b30) (clear b15) (arm-empty)
   added: (holding b15) (clear b30)
   goals met: 25 of 30
152. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 25 of 30
153. (pickup b30)
   deleted: (clear b30) (on-table b30) (arm-empty)
   added: (holding b30)
   goals met: 25 of 30
154. (stack b30 b18)
   deleted: (clear b18) (holding b30)
   added: (arm-empty) (clear b30) (on b30 b18)
   goals met: 26 of 30
155. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 26 of 30
156. (stack b15 b30)
   deleted: (clear b30) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b30)
   goals met: 27 of 30
157. (pickup b26)
   deleted: (clear b26) (on-table b26) (arm-empty)
   added: (holding b26)
   goals met: 27 of 30
158. (stack b26 b15)
   deleted: (clear b15) (holding b26)
   added: (arm-empty) (clear b26) (on b26 b15)
   goals met: 28 of 30
159. (unstack b14 b20)
   deleted: (on b14 b20) (clear b14) (arm-empty)
   added: (holding b14) (clear b20)
   goals met: 27 of 30
160. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 27 of 30
161. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 27 of 30
162. (stack b20 b26)
   deleted: (clear b26) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b26)
   goals met: 28 of 30
163. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 28 of 30
164. (stack b14 b20)
   deleted: (clear b20) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b20)
   goals met: 29 of 30
165. (unstack b22 b17)
   deleted: (on b22 b17) (clear b22) (arm-empty)
   added: (holding b22) (clear b17)
   goals met: 28 of 30
166. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 28 of 30
167. (unstack b17 b12)
   deleted: (on b17 b12) (clear b17) (arm-empty)
   added: (holding b17) (clear b12)
   goals met: 27 of 30
168. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 27 of 30
169. (unstack b12 b24)
   deleted: (on b12 b24) (clear b12) (arm-empty)
   added: (holding b12) (clear b24)
   goals met: 26 of 30
170. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 26 of 30
171. (unstack b24 b28)
   deleted: (on b24 b28) (clear b24) (arm-empty)
   added: (holding b24) (clear b28)
   goals met: 25 of 30
172. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 25 of 30
173. (unstack b28 b25)
   deleted: (on b28 b25) (clear b28) (arm-empty)
   added: (holding b28) (clear b25)
   goals met: 24 of 30
174. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 24 of 30
175. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 24 of 30
176. (stack b25 b10)
   deleted: (clear b10) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b10)
   goals met: 25 of 30
177. (pickup b28)
   deleted: (clear b28) (on-table b28) (arm-empty)
   added: (holding b28)
   goals met: 25 of 30
178. (stack b28 b25)
   deleted: (clear b25) (holding b28)
   added: (arm-empty) (clear b28) (on b28 b25)
   goals met: 26 of 30
179. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 26 of 30
180. (stack b24 b28)
   deleted: (clear b28) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b28)
   goals met: 27 of 30
181. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 27 of 30
182. (stack b22 b17)
   deleted: (clear b17) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b17)
   goals met: 28 of 30
183. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 28 of 30
184. (stack b12 b24)
   deleted: (clear b24) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b24)
   goals met: 29 of 30
185. (unstack b22 b17)
   deleted: (on b22 b17) (clear b22) (arm-empty)
   added: (holding b22) (clear b17)
   goals met: 28 of 30
186. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 28 of 30
187. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 28 of 30
188. (stack b17 b12)
   deleted: (clear b12) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b12)
   goals met: 29 of 30
189. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 29 of 30
190. (stack b22 b17)
   deleted: (clear b17) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b17)
   goals met: 30 of 30
